#+TITLE: Zig Test

* Test simple execution
#+begin_src zig :tangle /tmp/simple-zigtest.zig
const warn = @import("std").debug.warn;

pub fn main() void {
    warn("WARN:Hello, world!\n", .{});
}
#+end_src

#+RESULTS:
: >zig run /tmp/babel-Xb5w59/Zig-src-A9hmFu.zig
: STDOUT:
:
: STDERR:
: WARN:Hello, world!

* Test no main
#+begin_src zig :tangle /tmp/simple-zigtest-nomain.zig :imports '(std)
    std.debug.warn("WARN:Hello, world!\n", .{});
#+end_src

#+RESULTS:
: >zig run /tmp/babel-Xb5w59/Zig-src-CDuuSO.zig
: STDOUT:
:
: STDERR:
: WARN:Hello, world!
